-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Hôte : 127.0.0.1:3306
-- Généré le : jeu. 12 mars 2026 à 08:35
-- Version du serveur : 11.8.3-MariaDB-log
-- Version de PHP : 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de données : `u135579832_wurami_Db`
--

-- --------------------------------------------------------

--
-- Structure de la table `communes`
--

CREATE TABLE `communes` (
  `id` varchar(191) NOT NULL,
  `name` varchar(191) NOT NULL,
  `departmentId` varchar(191) NOT NULL,
  `createdAt` datetime(3) NOT NULL DEFAULT current_timestamp(3),
  `updatedAt` datetime(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `communes`
--

INSERT INTO `communes` (`id`, `name`, `departmentId`, `createdAt`, `updatedAt`) VALUES
('5a2b7e7b-1dee-11f1-9f08-bc111e65a1f8', 'Banikoara', 'db390482-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8282-1dee-11f1-9f08-bc111e65a1f8', 'Gogounou', 'db390482-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b836f-1dee-11f1-9f08-bc111e65a1f8', 'Kandi', 'db390482-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b83ab-1dee-11f1-9f08-bc111e65a1f8', 'Karimama', 'db390482-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b83e8-1dee-11f1-9f08-bc111e65a1f8', 'Malanville', 'db390482-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b841e-1dee-11f1-9f08-bc111e65a1f8', 'Ségbana', 'db390482-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b845b-1dee-11f1-9f08-bc111e65a1f8', 'Boukoumbé', 'db39092f-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b849a-1dee-11f1-9f08-bc111e65a1f8', 'Cobly', 'db39092f-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b84db-1dee-11f1-9f08-bc111e65a1f8', 'Kérou', 'db39092f-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8517-1dee-11f1-9f08-bc111e65a1f8', 'Kouandé', 'db39092f-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b854c-1dee-11f1-9f08-bc111e65a1f8', 'Matéri', 'db39092f-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b858b-1dee-11f1-9f08-bc111e65a1f8', 'Natitingou', 'db39092f-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b85c4-1dee-11f1-9f08-bc111e65a1f8', 'Péhunco', 'db39092f-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b85f7-1dee-11f1-9f08-bc111e65a1f8', 'Tanguiéta', 'db39092f-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8631-1dee-11f1-9f08-bc111e65a1f8', 'Toukountouna', 'db39092f-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8663-1dee-11f1-9f08-bc111e65a1f8', 'Abomey-Calavi', 'db3909bf-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8698-1dee-11f1-9f08-bc111e65a1f8', 'Allada', 'db3909bf-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b86cd-1dee-11f1-9f08-bc111e65a1f8', 'Kpomassè', 'db3909bf-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b86fa-1dee-11f1-9f08-bc111e65a1f8', 'Ouidah', 'db3909bf-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b872d-1dee-11f1-9f08-bc111e65a1f8', 'Sô-Ava', 'db3909bf-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8765-1dee-11f1-9f08-bc111e65a1f8', 'Toffo', 'db3909bf-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8796-1dee-11f1-9f08-bc111e65a1f8', 'Tori-Bossito', 'db3909bf-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b87cb-1dee-11f1-9f08-bc111e65a1f8', 'Zè', 'db3909bf-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8807-1dee-11f1-9f08-bc111e65a1f8', 'Bembèrèkè', 'db3909e1-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b883d-1dee-11f1-9f08-bc111e65a1f8', 'Kalalé', 'db3909e1-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8873-1dee-11f1-9f08-bc111e65a1f8', 'N\'Dali', 'db3909e1-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b88ad-1dee-11f1-9f08-bc111e65a1f8', 'Nikki', 'db3909e1-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b88e5-1dee-11f1-9f08-bc111e65a1f8', 'Parakou', 'db3909e1-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b891b-1dee-11f1-9f08-bc111e65a1f8', 'Pèrèrè', 'db3909e1-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8956-1dee-11f1-9f08-bc111e65a1f8', 'Sinendé', 'db3909e1-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8989-1dee-11f1-9f08-bc111e65a1f8', 'Tchaourou', 'db3909e1-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b89b8-1dee-11f1-9f08-bc111e65a1f8', 'Bantè', 'db390a01-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b89f0-1dee-11f1-9f08-bc111e65a1f8', 'Dassa-Zoumè', 'db390a01-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8a25-1dee-11f1-9f08-bc111e65a1f8', 'Glazoué', 'db390a01-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8a57-1dee-11f1-9f08-bc111e65a1f8', 'Ouèssè', 'db390a01-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8aac-1dee-11f1-9f08-bc111e65a1f8', 'Savalou', 'db390a01-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8ae2-1dee-11f1-9f08-bc111e65a1f8', 'Savè', 'db390a01-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8b11-1dee-11f1-9f08-bc111e65a1f8', 'Aplahoué', 'db390a26-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8b4c-1dee-11f1-9f08-bc111e65a1f8', 'Djakotomey', 'db390a26-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8b85-1dee-11f1-9f08-bc111e65a1f8', 'Dogbo', 'db390a26-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8bbc-1dee-11f1-9f08-bc111e65a1f8', 'Klouékanmè', 'db390a26-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8bf3-1dee-11f1-9f08-bc111e65a1f8', 'Lalo', 'db390a26-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8c2d-1dee-11f1-9f08-bc111e65a1f8', 'Toviklin', 'db390a26-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8c69-1dee-11f1-9f08-bc111e65a1f8', 'Bassila', 'db390a4e-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8ca3-1dee-11f1-9f08-bc111e65a1f8', 'Copargo', 'db390a4e-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8cde-1dee-11f1-9f08-bc111e65a1f8', 'Djougou', 'db390a4e-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8d18-1dee-11f1-9f08-bc111e65a1f8', 'Ouaké', 'db390a4e-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8d55-1dee-11f1-9f08-bc111e65a1f8', 'Cotonou', 'db390a6a-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8d8f-1dee-11f1-9f08-bc111e65a1f8', 'Athiémé', 'db390a88-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8dc6-1dee-11f1-9f08-bc111e65a1f8', 'Bopa', 'db390a88-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8e04-1dee-11f1-9f08-bc111e65a1f8', 'Comè', 'db390a88-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8e5b-1dee-11f1-9f08-bc111e65a1f8', 'Grand-Popo', 'db390a88-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8e94-1dee-11f1-9f08-bc111e65a1f8', 'Houéyogbé', 'db390a88-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8ed1-1dee-11f1-9f08-bc111e65a1f8', 'Lokossa', 'db390a88-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8f0d-1dee-11f1-9f08-bc111e65a1f8', 'Adjarra', 'db390aa3-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8f4a-1dee-11f1-9f08-bc111e65a1f8', 'Adjohoun', 'db390aa3-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8f84-1dee-11f1-9f08-bc111e65a1f8', 'Aguégués', 'db390aa3-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8fbb-1dee-11f1-9f08-bc111e65a1f8', 'Akpro-Missérété', 'db390aa3-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b8feb-1dee-11f1-9f08-bc111e65a1f8', 'Avrankou', 'db390aa3-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b901e-1dee-11f1-9f08-bc111e65a1f8', 'Bonou', 'db390aa3-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b9053-1dee-11f1-9f08-bc111e65a1f8', 'Dangbo', 'db390aa3-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b9084-1dee-11f1-9f08-bc111e65a1f8', 'Porto-Novo', 'db390aa3-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b90b8-1dee-11f1-9f08-bc111e65a1f8', 'Sèmè-Podji', 'db390aa3-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b90f3-1dee-11f1-9f08-bc111e65a1f8', 'Adja-Ouèrè', 'db390abc-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b9125-1dee-11f1-9f08-bc111e65a1f8', 'Ifangni', 'db390abc-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b915a-1dee-11f1-9f08-bc111e65a1f8', 'Kétou', 'db390abc-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b918f-1dee-11f1-9f08-bc111e65a1f8', 'Pobè', 'db390abc-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b91cb-1dee-11f1-9f08-bc111e65a1f8', 'Sakété', 'db390abc-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b9204-1dee-11f1-9f08-bc111e65a1f8', 'Abomey', 'db390ad5-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b923e-1dee-11f1-9f08-bc111e65a1f8', 'Agbangnizoun', 'db390ad5-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b9274-1dee-11f1-9f08-bc111e65a1f8', 'Bohicon', 'db390ad5-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b92c8-1dee-11f1-9f08-bc111e65a1f8', 'Covè', 'db390ad5-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b9302-1dee-11f1-9f08-bc111e65a1f8', 'Djidja', 'db390ad5-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b9333-1dee-11f1-9f08-bc111e65a1f8', 'Ouinhi', 'db390ad5-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b9367-1dee-11f1-9f08-bc111e65a1f8', 'Za-Kpota', 'db390ad5-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b939c-1dee-11f1-9f08-bc111e65a1f8', 'Zangnanado', 'db390ad5-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000'),
('5a2b93d1-1dee-11f1-9f08-bc111e65a1f8', 'Zogbodomey', 'db390ad5-1dec-11f1-9f08-bc111e65a1f8', '2026-03-12 08:34:57.000', '2026-03-12 08:34:57.000');

--
-- Index pour les tables déchargées
--

--
-- Index pour la table `communes`
--
ALTER TABLE `communes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `communes_name_departmentId_key` (`name`,`departmentId`),
  ADD KEY `communes_departmentId_fkey` (`departmentId`);

--
-- Contraintes pour les tables déchargées
--

--
-- Contraintes pour la table `communes`
--
ALTER TABLE `communes`
  ADD CONSTRAINT `communes_departmentId_fkey` FOREIGN KEY (`departmentId`) REFERENCES `departments` (`id`) ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
